app/models/setting.rb

SELECT "settings".* FROM "settings" WHERE "settings"."key" = $1 LIMIT $2  [["key", "algo_config_overrides"], ["LIMIT", 1]]
---
  def self.require!(key)
    raw = Rails.cache.fetch("setting:#{key}", expires_in: 30.seconds) do
      find_by(key:)&.value